export type PageItem = {
    src: string;
    date: string;
    caption: string;
};

export const pages: PageItem[] = [
    { src: "/photos/19-01-2025.jpeg", date: "19-01-2025", caption: "จุดเริ่มต้นเรื่องราวของเรา (วันแรกที่เราเริ่มคบกัน)" },
    { src: "/photos/26-01-2025.jpeg", date: "26-01-2025", caption: "go to ระยอง..." },
    { src: "/photos/27-01-2025.jpeg", date: "27-01-2025", caption: "เจอครอบครัวพี่ครั้งแรก (จู่ๆแม่ก็ยกกล้องขึ้นมา selfie)" },
    { src: "/photos/27-01-2025_01.jpeg", date: "27-01-2025", caption: "แม่พี่แอบถ่ายเราด้วย" },
    { src: "/photos/09-02-2025_174611.jpg", date: "09-02-2025", caption: "ครั้งแรกที่ไปรอรับสระบุรี" },
    { src: "/photos/09-02-2025_181756.jpg", date: "09-02-2025", caption: "เจอไอ่ข้าวหอมครั้งแรก " },
    { src: "/photos/14-02-2025_192120.jpg", date: "14-02-2025", caption: "วันวาเลนไทน์ปีแรก" },
    { src: "/photos/14-02-2025_201631.jpg", date: "14-02-2025", caption: "วันวาเลนไทน์ปีแรก (มองกล้องหน่อย)" },
    { src: "/photos/17-02-2025_224139.jpg", date: "17-02-2025", caption: "ขอบคุณสำหรับดอกไม้ค้าบ :3" },
    { src: "/photos/19-02-2025_230714.jpg", date: "19-02-2025", caption: "ครบรอบ 1 เดือนแล้วว ฉลองกันหน่อย" },
    { src: "/photos/23-02-2025_193109.jpg", date: "23-02-2025", caption: "ไปทำบุญกัน at วัดมังกร" },
    { src: "/photos/01-03-2025_150939.jpg", date: "01-03-2025", caption: "ไปเที่ยวกันที่ระยอง" },
    { src: "/photos/01-03-2025_185101.jpg", date: "01-03-2025", caption: "Happy hour ที่ระยอง" },
    { src: "/photos/02-03-2025_112901.jpg", date: "02-03-2025", caption: "ชิวๆกับอ่างอาบน้ำจากุซซี่ 555+" },
    { src: "/photos/09-03-2025_131301.jpg", date: "09-03-2025", caption: "เจอไอ่ข้าวฟ่างครั้งแรก โดดขึ้นมานอนตัดเฉย (คิดถึงมันจัง)" },
    { src: "/photos/19-03-2025_193036.jpg", date: "19-03-2025", caption: "ขยันทำงานจริงๆ ทำงานได้ทุกที่ ep.1" },
    { src: "/photos/24-03-2025_213509.jpg", date: "24-03-2025", caption: "แหนะๆ เอาอีกแล้ว ทำงานอีกแล้ว ep.2" },
    { src: "/photos/07-04-2025_155032.jpg", date: "07-04-2025", caption: "IKEA เดินซื้อของกัน" },
    { src: "/photos/16-04-2025_123920.jpg", date: "16-04-2025", caption: "Welcome to chiangrai ครับผมม" },
    { src: "/photos/16-04-2025_134250.jpg", date: "16-04-2025", caption: "ดินเนอร์หรูที่เชียงราย (ครัวบ้านเหนือ ริมหนองบัว)" },
    { src: "/photos/16-04-2025_201038.jpg", date: "16-04-2025", caption: "ถึงบ้านแล้ว พี่เพชรมารอตอนรับ (คิดถึงพี่เพชร)" },
    { src: "/photos/17-04-2025_091850.jpg", date: "17-04-2025", caption: "Surprise วันเกิดเด็กดื้อของพี่ <3 (จำได้ว่าหลานๆเตรียม Surprise สุดๆ)" },
    { src: "/photos/17-04-2025_154557.jpg", date: "17-04-2025", caption: "ถ่ายรูปกับ my family" },
    { src: "/photos/17-04-2025_201944.jpg", date: "19-04-2025", caption: "26 ปีแล้วนะ เด็กดื้อของพี่" },
    { src: "/photos/09-05-2025_212828.jpg", date: "09-05-2025", caption: "พัทยา trip เจอน้าพี่ครั้งแรก" },
    { src: "/photos/10-05-2025_113449.jpg", date: "10-05-2025", caption: "เตรียมตัวไปเที่ยว" },
    { src: "/photos/18-05-2025_230721.jpg", date: "18-05-2025", caption: "กลับมาจากเที่ยวก็ทำงานอีกแล้ว" },
    { src: "/photos/19-05-2025_002417.jpg", date: "19-05-2025", caption: "ให้มันรู้ซะบ้างว่าใครใหญ่" },
    { src: "/photos/30-05-2025_221519.jpg", date: "30-05-2025", caption: "เที่ยวเขาใหญ่กับ the gang (เด็กเตรียมเหล้าหน้าคุ้นๆ)" },
    { src: "/photos/31-05-2025_211345.jpg", date: "31-05-2025", caption: "ชิวๆกับการ drinks" },
    { src: "/photos/03-06-2025_002957.jpg", date: "03-06-2025", caption: "วันเกิดของพี่ มีเด็กซื้อแซลมอนเค้กมาเซอร์ไพรส์ <3" },
    { src: "/photos/03-06-2025_125014.jpg", date: "03-06-2025", caption: "ดินเนอร์วันเกิดที่ home pro bangna" },
    { src: "/photos/15-06-2025_144947.jpg", date: "15-06-2025", caption: "พาเด็กน้อยไปดูเจ้าเขี้ยวกุด" },
    { src: "/photos/04-07-2025_080217.jpg", date: "04-07-2025", caption: "เริ่มต้นเดือน 7 ด้วยการถ่ายหน้ากระจก :p" },
    { src: "/photos/06-07-2025_151525.jpg", date: "06-07-2025", caption: "มีคนช่วยดูแผนที่ด้วย (ในฝันละแหละ)" },
    { src: "/photos/20-07-2025_130912.jpg", date: "20-07-2025", caption: "คัมซามีดาสักหน่อยที่ mega bangna" },

];